build/web/WEB-INF/wsdl/localhost_8080/CalculatorWS/CalculatorWS.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.1-b419 (branches/2.3.1.x-7937; 2014-08-04T08:11:03+0000) JAXWS-RI/2.2.10-b140803.1500 JAXWS-API/2.2.11 JAXB-RI/2.2.10-b140802.1033 JAXB-API/2.2.12-b140109.1041 svn-revision#unknown. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.1-b419 (branches/2.3.1.x-7937; 2014-08-04T08:11:03+0000) JAXWS-RI/2.2.10-b140803.1500 JAXWS-API/2.2.11 JAXB-RI/2.2.10-b140802.1033 JAXB-API/2.2.12-b140109.1041 svn-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://calculator.me.org/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://calculator.me.org/" name="CalculatorWS">
<types>
<xsd:schema>
<xsd:import namespace="http://calculator.me.org/" schemaLocation="http://localhost:8080/CalculatorWS/CalculatorWS?xsd=1"/>
</xsd:schema>
</types>
<message name="division">
<part name="parameters" element="tns:division"/>
</message>
<message name="divisionResponse">
<part name="parameters" element="tns:divisionResponse"/>
</message>
<message name="SaisieErroneeException">
<part name="fault" element="tns:SaisieErroneeException"/>
</message>
<message name="multiply">
<part name="parameters" element="tns:multiply"/>
</message>
<message name="multiplyResponse">
<part name="parameters" element="tns:multiplyResponse"/>
</message>
<message name="substitution">
<part name="parameters" element="tns:substitution"/>
</message>
<message name="substitutionResponse">
<part name="parameters" element="tns:substitutionResponse"/>
</message>
<message name="add">
<part name="parameters" element="tns:add"/>
</message>
<message name="addResponse">
<part name="parameters" element="tns:addResponse"/>
</message>
<portType name="CalculatorWS">
<operation name="division">
<input wsam:Action="http://calculator.me.org/CalculatorWS/divisionRequest" message="tns:division"/>
<output wsam:Action="http://calculator.me.org/CalculatorWS/divisionResponse" message="tns:divisionResponse"/>
<fault message="tns:SaisieErroneeException" name="SaisieErroneeException" wsam:Action="http://calculator.me.org/CalculatorWS/division/Fault/SaisieErroneeException"/>
</operation>
<operation name="multiply">
<input wsam:Action="http://calculator.me.org/CalculatorWS/multiplyRequest" message="tns:multiply"/>
<output wsam:Action="http://calculator.me.org/CalculatorWS/multiplyResponse" message="tns:multiplyResponse"/>
<fault message="tns:SaisieErroneeException" name="SaisieErroneeException" wsam:Action="http://calculator.me.org/CalculatorWS/multiply/Fault/SaisieErroneeException"/>
</operation>
<operation name="substitution">
<input wsam:Action="http://calculator.me.org/CalculatorWS/substitutionRequest" message="tns:substitution"/>
<output wsam:Action="http://calculator.me.org/CalculatorWS/substitutionResponse" message="tns:substitutionResponse"/>
<fault message="tns:SaisieErroneeException" name="SaisieErroneeException" wsam:Action="http://calculator.me.org/CalculatorWS/substitution/Fault/SaisieErroneeException"/>
</operation>
<operation name="add">
<input wsam:Action="http://calculator.me.org/CalculatorWS/addRequest" message="tns:add"/>
<output wsam:Action="http://calculator.me.org/CalculatorWS/addResponse" message="tns:addResponse"/>
<fault message="tns:SaisieErroneeException" name="SaisieErroneeException" wsam:Action="http://calculator.me.org/CalculatorWS/add/Fault/SaisieErroneeException"/>
</operation>
</portType>
<binding name="CalculatorWSPortBinding" type="tns:CalculatorWS">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="division">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="SaisieErroneeException">
<soap:fault name="SaisieErroneeException" use="literal"/>
</fault>
</operation>
<operation name="multiply">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="SaisieErroneeException">
<soap:fault name="SaisieErroneeException" use="literal"/>
</fault>
</operation>
<operation name="substitution">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="SaisieErroneeException">
<soap:fault name="SaisieErroneeException" use="literal"/>
</fault>
</operation>
<operation name="add">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="SaisieErroneeException">
<soap:fault name="SaisieErroneeException" use="literal"/>
</fault>
</operation>
</binding>
<service name="CalculatorWS">
<port name="CalculatorWSPort" binding="tns:CalculatorWSPortBinding">
<soap:address location="http://localhost:8080/CalculatorWS/CalculatorWS"/>
</port>
</service>
</definitions>